a=float(input("Введіть число a: "))
b=float(input("Введіть число b: "))
c=float(input("Введіть число c: "))
d=float(input("Введіть число d: "))

if 1<=a<=2 and c<a<d:
    print("а належить інтервалу")
else:
    print("a не належить інтервалу")

if 1 <= b <= 2 and c < b < d:
    print("b належить інтервалу")
else:
    print("b не належить інтервалу")

# Після цьго моменту ожемо не писати оператори if а просто
# print("c і d не належать "), так як c і d ніколи не будуть належати проміжку
# if 1 <= c <= 2 and c < c < d:
#     print("c належить інтервалу")
# else:
#     print("c не належить інтервалу")
#
# if 1<=d<=2 and c<d<d:
#     print("d належить інтервалу")
# else:
#     print("d не належить інтервалу")
print("c і d не належать інтервалу")
