# Дана цілочислова квадратна матриця. Розмістити елементи непарних рядків у порядку зростання.
r = int(input("Введіть кількість рядків та елементів матриці: "))

m = [[float(input("Введіть координати матриці a[{0}][{1}]=".format(i,j))) for j in range(r)] for i in range(r)]

print(m)
for i in range(1,r,2): #Можна зробити range(0,r,2) для звичайного користувача
    m[i].sort()
print("Відсортована матриця: {0}".format(m))

